# Databricks notebook source
#==================================================================#
#    I - Charger le fichier main.R                                 #
#==================================================================#

source("code/main.R", encoding = "UTF-8")

#==================================================================#
#   II - Fonction principale                                       #
#==================================================================#

result <- run_suivi_engagement()


#==================================================================#
#  III - Stocker les prédictions "Sur Mesure" dans un fichier CSV  #
#==================================================================#

write_fcst_profiler(result)

#==================================================================#
#   IV - Stocker les prédictions de OPTEAM dans un fichier CSV     #
#==================================================================#

write_fcst_opteam(result)

#==================================================================#
#    V - Stocker les historiques réels dans un fichier CSV         #
#==================================================================#

write_hist_reel(result)

#==================================================================#
#   VI - Stocker les historiques dé-climatisés dans un fichier CSV #
#==================================================================#

write_hist_norm(result)

#==================================================================#
#  VII - Tracer les graphiques des consommations agrégées          #
#==================================================================#

plot_agg(result)

#==================================================================#
# VIII - Tracer les graphiques des consommations par PCE           #
#==================================================================#

plot_pce(result)

#==================================================================#
#   IX - Stocker les historiques par PCE dans des fichiers CSV     #
#==================================================================#

write_hist_by_pce()
